# Завдання 1
# Напишіть програму, яка запитує два цілих числа x і y, після чого обчислює і виводить значення 
# x у степені y.

# num1 = int(input("Enter number 1 - "))
# num2 = int(input("Enter number 2 - "))
# print(f"Число {num1} в степени {num2} равно - {num1**num2}")

# Завдання 2
# Користувач вводить ціле додатне число. Програма повинна знайти і вивести всі його дільники, 
# а також їхню кількість.
# Приклад введення:
# Введіть число: 28.
# Приклад виведення:
# Дільники числа 28: 1, 2, 4, 7, 14, 28.
# Кількість дільників: 6.

# n=int(input("Enter number: "))
# count = 0
# if n<=0:
#     print("Введіть ціле додатнє число")
# else:
#  for i in range(1,n+1):
#     if n % i ==0:
#         print(i,end=" ")
#         count+=1
# print(f"Кількість дільників:{count}")

# Завдання 3
# Підрахувати кількість цілих чисел у діапазоні від 100 до 999 у яких є дві однакові цифри.

# count=0
# for i in range(100,1000):
#     a = i//100
#     b = (i//10)%10
#     c = i%10
#     if a==b or a==c or b==c:
#         count+=1
# print(count)

# Завдання 4
# Підрахувати кількість цілих чисел у діапазоні від 100 до 9999 у яких усі цифри різні
# count = 0
# for i in range(100, 10000):
#     dig = str(i)
#     if len(set(dig))==len(dig):
#         count+=1
#     print(count)



