# Завдання 1
# Користувач вводить висоту трикутника і символ для заповнення. Програма повинна вивести трикутник,
# вирівняний по правому краю.

# rows = int(input("Entert H - "))
# symb = input("Enter symbol - ")
# for i in range(1,rows+1):
#     for j in range(i):
#         print(symb, end=" ")
#     print()

# Завдання 2
# Користувач вводить розміри дошки (ширину і висоту) і два символи для клітинок. 
# Програма повинна відобразити шахову дошку, використовуючи ці символи.

# height = int(input("Enter height - "))
# widht  = int(input("Enter widht - "))
# symb1 = input("Enter symbol 1 - ")
# symb2 = input("Enter symbol 2 - ")
# for i in range(height):
#     line = ""
#     for b in range(widht):
#         if(i+b)%2==0:
#             line+=symb1
#         else:
#             line+=symb2
#     print(line)


# Завдання 4
# Число Армстронга — це число, яке дорівнює сумі своїх цифр, піднесених до степеня, що дорівнює 
# кількості цифр.
# Напишіть програму, яка:
# Приймає одне число від користувача.
# Перевіряє, чи є воно числом Армстронга.
# Виводить відповідний результат.

# num = input("Enter number - ")
# a = len(num)
# sum = 0
# for i in range(len(num)):
#     digit = int(num[i])
#     sum+=digit**a

# if int(num)==sum:
#       print("Число Армстронга")  
# else:
#       print(" Це не число Армстронга")  


# Завдання 5
# Користувач вводить висоту ромба (непарне число) і символ для заповнення. Програма повинна 
# вивести заповнений ромб.
# Приклад введення:
# Введіть висоту: 5.
# Введіть символ: #.

# rows = int(input("Entert H - "))
# symb = input("Enter symbol - ")
# if rows%2==0:
#     print("Висота повинна бути непарним числом")
# else:
#     a = rows/2

#     for i in range(rows):
#         if i<=a:
#             b = i+1
#         else:
#             b = rows-i
#         print(symb*b)    
          
         


# Завдання 6
# Користувач вводить висоту ромба (непарне число) і символ для заповнення. Програма 
# повинна вивести порожнистий ромб.
# Приклад введення:
# Введіть висоту: 7.
# Введіть символ: #.


